app/controllers/infection_reports_controller.rb

  def index
    @infection_reports = InfectionReport.all
---
SELECT "infection_reports".* FROM "infection_reports"