app/controllers/resources_controller.rb

INSERT INTO "resources" ("name", "points", "code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "gold"], ["points", 10], ["code", 5], ["created_at", 2017-01-02 16:28:51 UTC], ["updated_at", 2017-01-02 16:28:51 UTC]]
---
  def create
    @resource = Resource.new(resource_params)

    if @resource.save

DELETE FROM "resources" WHERE "resources"."id" = $1  [["id", 1]]
---
  def destroy
    @resource.destroy

SELECT  "resources".* FROM "resources" WHERE "resources"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_resource
      @resource = Resource.find(params[:id])