app/controllers/survivors_controller.rb

  def trade
    @trade_survivor = Survivor.find(survivor_trade_params[:survivor_id])
---
SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def report_infection
    @reported = Survivor.find_by(:id=>infected_param[:infected])
    infection_report = InfectionReport.new(:reporter_survivor => @survivor, :reported_survivor => @reported)
    infection_report.save_and_verify_occurrences
---
SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "infection_reports" ("reporter_survivor_id", "reported_survivor_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["reporter_survivor_id", 1], ["reported_survivor_id", 1], ["created_at", 2016-12-27 16:18:14 UTC], ["updated_at", 2016-12-27 16:18:14 UTC]]

  def last_location
    @survivor.update(:last_location_longitude => last_location_params[:longitude],
      :last_location_latitude => last_location_params[:latitude])
---
UPDATE "survivors" SET "last_location_longitude" = $1, "last_location_latitude" = $2, "updated_at" = $3 WHERE "survivors"."id" = $4  [["last_location_longitude", #<BigDecimal:32a8a98,'0.2333401E1',18(36)>], ["last_location_latitude", #<BigDecimal:32a8778,'-0.109E1',18(36)>], ["updated_at", 2016-12-26 19:17:39 UTC], ["id", 1]]

  def create

    @survivor = Survivor.new(survivor_params)

    if @survivor.save

      survivor_items_params.each do |type,qtd|
        item = Item.factory(type,@survivor,qtd)
        item.save
---
INSERT INTO "survivors" ("name", "age", "gender", "last_location_longitude", "last_location_latitude", "infected", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "items" ("resource_id", "survivor_id", "quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["resource_id", 29], ["survivor_id", 1], ["quantity", 4], ["created_at", 2016-12-26 17:42:57 UTC], ["updated_at", 2016-12-26 17:42:57 UTC]]

  def update
    if @survivor.update(survivor_params)
---
UPDATE "survivors" SET "last_location_latitude" = ?, "updated_at" = ? WHERE "survivors"."id" = ?  [["last_location_latitude", #<BigDecimal:7fe058538dc0,'0.20005E1',18(18)>], ["updated_at", 2016-12-26 14:06:31 UTC], ["id", 1]]

  def destroy
    @survivor.destroy
---
DELETE FROM "survivors" WHERE "survivors"."id" = $1  [["id", 7]]

    def set_survivor
      @survivor = Survivor.find(params[:id])
---
SELECT  "survivors".* FROM "survivors" WHERE "survivors"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]